working to triage this further, it appears the weird unrelated fields showing as changing isn't unique to just the dhcpd_config field, changing any other field also shows them as changing. 

It just happens that dhcpd_config with certain values results in a constant diff.

For example, if I change ike_lifetime to 28801 it will show
```
  ~ resource "mist_device_gateway" "gateway_one" {
      + deviceprofile_id       = (known after apply)
      + image1_url             = (known after apply)
      + image2_url             = (known after apply)
      + image3_url             = (known after apply)
      ~ mac                    = "redacted" -> (known after apply)
      ~ model                  = "redacted" -> (known after apply)
        name                   = "gateway_one"
      ~ serial                 = "redacted" -> (known after apply)
      ~ tunnel_configs         = {
          ~ "default" = {
              ~ ike_lifetime    = 28800 -> 28801
                # (12 unchanged attributes hidden)
            },
        }
      ~ type                   = "gateway" -> (known after apply)
        # (8 unchanged attributes hidden)
    }
```

but once I apply this and accept the change, the diff will go away unlike with `dhcpd_config.config`

Seems there are two issues. 
1.  Something about `dhcpd_config.config` causes an constant diff
2. When there is a diff the following fields always show a change deviceprofile_id, image1_url, image2_url, image3_url, mac, model, serial, type, which I guess could be expected since they are marked as computed fields?